src/WebHooks/test/Microsoft.AspNetCore.WebHooks.FunctionalTest/Resources/RequestBodies/Salesforce.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
 <soapenv:Body>
  <notifications xmlns="http://soap.sforce.com/2005/09/outbound">
   <OrganizationId>012345678901234</OrganizationId>
   <ActionId>04k1I000000bmsHQAQ</ActionId>
   <SessionId>00D1I000003qqqE!AQsAQOjGFnFJzGPA12yhUGL9Aii0N6lADjH2bNUBHRer5QjjTq3_RbIzlAqHBkfjp3vlHhlwByFY9MJQJlgz_7YaGJZzRF3t</SessionId>
   <EnterpriseUrl>https://na73.salesforce.com/services/Soap/c/41.0/00D1I000003qqqE</EnterpriseUrl>
   <PartnerUrl>https://na73.salesforce.com/services/Soap/u/41.0/00D1I000003qqqE</PartnerUrl>
   <Notification>
    <Id>04l1I000000fztEQAQ</Id>
    <sObject xsi:type="sf:Contact" xmlns:sf="urn:sobject.enterprise.soap.sforce.com">
     <sf:Id>0031I0000081tbPQAQ</sf:Id>
     <sf:CreatedDate>2017-12-11T21:49:24.000Z</sf:CreatedDate>
     <sf:FirstName>Jeraldine</sf:FirstName>
     <sf:LastName>Black</sf:LastName>
     <sf:Title>White</sf:Title>
    </sObject>
   </Notification>
   <Notification>
    <Id>04l1I000000fzt9QAA</Id>
    <sObject xsi:type="sf:Contact" xmlns:sf="urn:sobject.enterprise.soap.sforce.com">
     <sf:Id>0031I0000081tb0QAA</sf:Id>
     <sf:CreatedDate>2017-12-11T21:44:55.000Z</sf:CreatedDate>
     <sf:Email>drb24@cornell.edu</sf:Email>
     <sf:FirstName>Doug</sf:FirstName>
     <sf:LastName>Bunting</sf:LastName>
     <sf:Title>Supreme Being</sf:Title>
    </sObject>
   </Notification>
  </notifications>
 </soapenv:Body>
</soapenv:Envelope>
